{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_9", "layers": [{"class_name": "DenseFeatures", "config": {"name": "dense_features_9", "trainable": true, "dtype": "float32", "feature_columns": [{"class_name": "BucketizedColumn", "config": {"source_column": {"class_name": "NumericColumn", "config": {"key": "area", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, "boundaries": [25.0, 35.0, 45.0, 55.0, 65.0, 75.0, 85.0, 95.0, 105.0, 115.0, 125.0, 155.0, 175.0, 225.0, 275.0, 325.0, 375.0, 425.0]}}, {"class_name": "IndicatorColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "condition", "vocabulary_list": ["All amenities", "Partial amenities", "Without amenities"], "dtype": "string", "default_value": -1, "num_oov_buckets": 0}}}}, {"class_name": "IndicatorColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "district", "vocabulary_list": ["Purvciems", "Ziepniekkalns", "centrs", "\u0136engarags", "Teika", "Imanta", "Jugla", "Manga\u013ci", "Me\u017eciems", "Maskavas priek\u0161pils\u0113ta", "Zolit\u016bde", "Bolder\u0101ja", "Gr\u012bzi\u0146kalns", "Dreili\u0146i", "P\u013cavnieki", "Dzegu\u017ekalns", "\u0136\u012bpsala", "Krasta r-ns", "Kl\u012bversala", "Vecm\u012blgr\u0101vis", "\u0100genskalns", "Zasulauks", "Me\u017eaparks", "\u010ciekurkalns", "Sarkandaugava", "Daugavgr\u012bva", "I\u013c\u0123uciems", "Ber\u0123i", "\u0160\u0137irotava", "D\u0101rzciems", "Vecr\u012bga", "Bieri\u0146i", "Brek\u0161i", "Kundzi\u0146sala", "Jaunciems", "Tor\u0146akalns", "Manga\u013csala", "\u0160amp\u0113teris-Pleskod\u0101le", "Bukulti", "Voleri", "Vecdaugava", "Aplokciems", "Katlakalns", "Kleisti", "Vec\u0101\u0137i", "Jaunm\u012blgr\u0101vis", "VEF", "Valdlau\u010di"], "dtype": "string", "default_value": -1, "num_oov_buckets": 0}}}}, {"class_name": "NumericColumn", "config": {"key": "floor", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "IndicatorColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "house_seria", "vocabulary_list": ["LT proj.", "602.", "P. kara", "Jaun.", "Specpr.", "Hru\u0161\u010d.", "119.", "M. \u0123im.", "Renov.", "103.", "Priv. m.", "467.", "Sta\u013cina", "104.", "\u010cehu pr."], "dtype": "string", "default_value": -1, "num_oov_buckets": 0}}}}, {"class_name": "IndicatorColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "house_type", "vocabulary_list": ["Brick-Panel", "Panel", "Wood", "Masonry", "Brick", "Panel-Brick"], "dtype": "string", "default_value": -1, "num_oov_buckets": 0}}}}, {"class_name": "IndicatorColumn", "config": {"categorical_column": {"class_name": "CrossedColumn", "config": {"keys": [{"class_name": "BucketizedColumn", "config": {"source_column": {"class_name": "NumericColumn", "config": {"key": "lat", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, "boundaries": [56.8597884, 56.86552293, 56.871257459999995, 56.87699198999999, 56.88272651999999, 56.88846104999999, 56.89419557999999, 56.899930109999985, 56.90566463999998, 56.91139916999998, 56.91713369999998, 56.92286822999998, 56.928602759999976, 56.934337289999974, 56.94007181999997, 56.94580634999997, 56.95154087999997, 56.957275409999966, 56.963009939999964, 56.96874446999996, 56.97447899999996, 56.98021352999996, 56.985948059999956, 56.991682589999954, 56.99741711999995, 57.00315164999995, 57.00888617999995, 57.014620709999946, 57.020355239999944, 57.02608976999994, 57.03182429999994, 57.03755882999994, 57.043293359999936, 57.049027889999934, 57.05476241999993, 57.06049694999993, 57.06623147999993, 57.071966009999926, 57.077700539999924, 57.08343506999992]}}, {"class_name": "BucketizedColumn", "config": {"source_column": {"class_name": "NumericColumn", "config": {"key": "lon", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, "boundaries": [23.9702807, 23.9776924, 23.985104099999997, 23.992515799999996, 23.999927499999995, 24.007339199999993, 24.014750899999992, 24.02216259999999, 24.02957429999999, 24.036985999999988, 24.044397699999987, 24.051809399999986, 24.059221099999984, 24.066632799999983, 24.07404449999998, 24.08145619999998, 24.08886789999998, 24.096279599999978, 24.103691299999976, 24.111102999999975, 24.118514699999974, 24.125926399999972, 24.13333809999997, 24.14074979999997, 24.14816149999997, 24.155573199999967, 24.162984899999966, 24.170396599999965, 24.177808299999963, 24.185219999999962, 24.19263169999996, 24.20004339999996, 24.207455099999958, 24.214866799999957, 24.222278499999955, 24.229690199999954, 24.237101899999953, 24.24451359999995, 24.25192529999995, 24.25933699999995, 24.266748699999948, 24.274160399999946, 24.281572099999945, 24.288983799999944, 24.296395499999942, 24.30380719999994, 24.31121889999994, 24.31863059999994]}}], "hash_bucket_size": 2500, "hash_key": null}}}}, {"class_name": "IndicatorColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "op_type", "vocabulary_list": ["For rent", "For sale"], "dtype": "string", "default_value": -1, "num_oov_buckets": 0}}}}, {"class_name": "NumericColumn", "config": {"key": "rooms", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "total_floors", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}]}}, {"class_name": "Dense", "config": {"name": "dense_48", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_18", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_49", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_19", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_50", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_51", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null]}}, "training_config": {"loss": {"class_name": "MeanAbsoluteError", "config": {"reduction": "auto", "name": "mean_absolute_error"}}, "metrics": [{"class_name": "MeanAbsoluteError", "config": {"name": "mean_absolute_error", "dtype": "float32"}}], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "RMSprop", "config": {"name": "RMSprop", "learning_rate": 0.0010000000474974513, "decay": 0.0, "rho": 0.8999999761581421, "momentum": 0.0, "epsilon": 1e-07, "centered": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "sequential_9/dense_48/kernel", "shape": [2596, 128], "dtype": "float32"}, {"name": "sequential_9/dense_48/bias", "shape": [128], "dtype": "float32"}, {"name": "sequential_9/dense_49/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "sequential_9/dense_49/bias", "shape": [64], "dtype": "float32"}, {"name": "sequential_9/dense_50/kernel", "shape": [64, 16], "dtype": "float32"}, {"name": "sequential_9/dense_50/bias", "shape": [16], "dtype": "float32"}, {"name": "sequential_9/dense_51/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "sequential_9/dense_51/bias", "shape": [1], "dtype": "float32"}]}]}